const sections = {
    home: `
    <section id="home">
        <h2>Досвід, перевірений десятиріччями</h2>
        <p>З 1989 року ми спеціалізуємося встановленні рибозахисних пристроїв на водозаборах будь-яких конструкцій та призначеннь:</p>промислових, комунальних, енергетичних та меліоративних підприємств.
        <p>Професійний підхід на усіх етапах робіт - від проектування до втілення проектів у життя, з урахуванням особливостей кожного обʼєкту.</p>
    </section>
    `,
    solutions: `
        <section>
            <h2>Наша місія</h2>
            <h3>3,6 млрд екземплярів риби та її малька гине на водозаборах щорічно.</h3>
            <p>У перерахунку на товарну рибу це більше, ніж виловлює за рік уся рибна ґалузь України.</p>
            <p>Проблеми екології на водозаборах без рибозахисту:
            <div class="list">
            <ul>
                <li>масована загибель риби та її молоді</li>
                <li>порушення процесу природного відтворення риби через загибель потенційних батьків майбутніх поколінь риби</li>
                <li>неможливість вільного проходу риби на місця нересту через дамби та греблі</li>
            </ul>
            </div>
            </p>
        </section>
    `,
    technology: `
        <section>
            <h2>Наші технології</h2>
            <p>Ми використовуємо передові технології з ефективністю до 70%, що значно зменшує ризики для рибних популяцій.</p>
        </section>
    `,
    about: `
        <section>
            <h2>Про компанію</h2>
            <p>Наша компанія була заснована у 1989 році та має понад 30 років досвіду у розробці систем рибозахисту.</p>
        </section>
    `,
    contact: `
        <section>
            <h2>Контакти</h2>
            <p>Зв’яжіться з нами для отримання додаткової інформації.</p>
            <form>
                <label for="name">Ім’я:</label>
                <input type="text" id="name" name="name" required>

                <label for="email">Email:</label>
                <input type="email" id="email" name="email" required>

                <label for="message">Повідомлення:</label>
                <textarea id="message" name="message" required></textarea>

                <button type="submit">Надіслати</button>
            </form>
        </section>
    `
};

function changeSection(section) {
    document.getElementById("content").innerHTML = sections[section];
}
